home-manager/software/emacs/emacs.d/loader.org
#+title: Emacs Configuration
:preamble:
#+setupfile: ~/git_repos/dot_files/docs/html_themes/theme-readtheorg.setup
#+latex_header: \input{/home/andreas/nextcloud/10_documents/99_archive/0000/settings/latex/style}
#+author: Andreas Zweili
#+options: todo:t toc:nil
:end:

* Enable Options

This example code can be used to wrap a code section to dis-/enable it with a
variable.

#+begin_example
(when (boundp 'enable-ox-pandoc)

)
#+end_example

This file contains all the variables. It gets ignored by git so that the user
can modify it's content. However it's default state is commited.

#+begin_src emacs-lisp
(load-file "~/.emacs.d/variables.el")
#+end_src

* Detect Environment

With these functions its possible to create configuration sections
which only run on a specific system. The can be used like this:

#+begin_example
(when (is-mac-p)
    (set-face-attribute 'default nil :height 165))


(add-hook 'after-make-frame-functions
  (lambda ()
    (if window-system

      )))
#+end_example

Taken from this configuration:

- https://github.com/mwfogleman/.emacs.d/blob/master/michael.org

#+begin_src emacs-lisp
(defun is-mac-p ()
    (eq system-type 'darwin))

(defun is-linux-p ()
    (eq system-type 'gnu/linux))

(defun is-windows-p ()
    (or (eq system-type 'ms-dos)
        (eq system-type 'windows-nt)
        (eq system-type 'cygwin)))

(defun is-bsd-p ()
    (eq system-type 'gnu/kfreebsd))
#+end_src

* Packages
** Repositories
*** MELPA

Melpa is an alternative repository for Emacs packages. Usually they
are comming directly from a git repository. This can make them
sometimes a bit unstable.

- https://melpa.org/#/

#+begin_src emacs-lisp
;; MELPA
(add-to-list 'package-archives
    '("melpa" . "https://melpa.org/packages/"))
#+end_src

*** Org-mode

Even though org-mode comes with Emacs by default I would like to use
the newever version from it's repository.

#+begin_src emacs-lisp
;; org-mode
;(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
#+end_src

** use-package

Use-package is a very handy package which can automatically download
specified packages. This helps with reinstalling Emacs. In addition it
allows you to load the packages and their configuration only when they
are needed. This helps with Emacs' startup time.

#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
        (package-refresh-contents)
        (package-install 'use-package))
(require 'use-package)
(use-package use-package-ensure-system-package
    :ensure t)
#+end_src

** evil-mode

Evil-mode is a package which emulates Vim in Emacs.

#+begin_src emacs-lisp
;; evil-mode allows to use vim keybindings
(use-package evil
    :ensure t
    :config
    ;; Start these modes in emacs mode
    (add-to-list 'evil-emacs-state-modes 'deft-mode)
    (add-to-list 'evil-emacs-state-modes 'neotree-mode)
    (add-to-list 'evil-emacs-state-modes 'helpful-mode)
    (setq global-evil-search-highlight-persist t)

    ;; Start these modes in insert mode
    (evil-set-initial-state 'mu4e-compose-mode 'insert)

    ;; Add vim keybindings to the bookmark menu
    (evil-add-hjkl-bindings bookmark-bmenu-mode-map 'emacs
        ;; (kbd "/")       'evil-search-forward
        (kbd "n")       'evil-search-next
        (kbd "N")       'evil-search-previous
        (kbd "C-d")     'evil-scroll-down
        (kbd "C-u")     'evil-scroll-up
        (kbd "C-w C-w") 'other-window)

    ;; Add vim keybindings to the ibuffer
    (evil-add-hjkl-bindings ibuffer-mode-map 'emacs
        ;; (kbd "/")       'evil-search-forward
        (kbd "n")       'evil-search-next
        (kbd "N")       'evil-search-previous
        (kbd "C-d")     'evil-scroll-down
        (kbd "C-u")     'evil-scroll-up
        (kbd "C-w C-w") 'other-window)

;; Add vim keybindings to the package mode
    (evil-add-hjkl-bindings package-menu-mode-map 'emacs
        ;; (kbd "/")       'evil-search-forward
        (kbd "n")       'evil-search-next
        (kbd "N")       'evil-search-previous
        (kbd "C-d")     'evil-scroll-down
        (kbd "C-u")     'evil-scroll-up
        (kbd "C-w C-w") 'other-window)

    (evil-add-hjkl-bindings helpful-mode-map 'emacs
        ;; (kbd "/")       'evil-search-forward
        (kbd "n")       'evil-search-next
        (kbd "N")       'evil-search-previous
        (kbd "C-d")     'evil-scroll-down
        (kbd "C-u")     'evil-scroll-up
        (kbd "C-w C-w") 'other-window)

    ;; vim keybindings for mu4e
    (evil-add-hjkl-bindings mu4e-headers-mode-map 'emacs
        (kbd "/")       'evil-search-forward
        (kbd "n")       'evil-search-next
        (kbd "N")       'evil-search-previous
        (kbd "C-d")     'evil-scroll-down
        (kbd "C-u")     'evil-scroll-up
        (kbd "C-w C-w") 'other-window)

    (evil-add-hjkl-bindings mu4e-view-mode-map 'emacs
        (kbd "C-d")     'evil-scroll-down
        (kbd "C-u")     'evil-scroll-up
        (kbd "C-w C-w") 'other-window)

    ;; evilificate calendar in org-mode
    (define-key org-read-date-minibuffer-local-map (kbd "M-h")
        (lambda ()
            (interactive) (org-eval-in-calendar '(calendar-backward-day 1))))
    (define-key org-read-date-minibuffer-local-map (kbd "M-l")
        (lambda ()
            (interactive) (org-eval-in-calendar '(calendar-forward-day 1))))
    (define-key org-read-date-minibuffer-local-map (kbd "M-k")
        (lambda ()
            (interactive) (org-eval-in-calendar '(calendar-backward-week 1))))
    (define-key org-read-date-minibuffer-local-map (kbd "M-j")
        (lambda ()
            (interactive) (org-eval-in-calendar '(calendar-forward-week 1))))
    (define-key org-read-date-minibuffer-local-map (kbd "M-H")
        (lambda ()
            (interactive) (org-eval-in-calendar '(calendar-backward-month 1))))
    (define-key org-read-date-minibuffer-local-map (kbd "M-L")
        (lambda ()
            (interactive) (org-eval-in-calendar '(calendar-forward-month 1))))
    (define-key org-read-date-minibuffer-local-map (kbd "M-K")
        (lambda ()
            (interactive) (org-eval-in-calendar '(calendar-backward-year 1))))
    (define-key org-read-date-minibuffer-local-map (kbd "M-J")
        (lambda ()
            (interactive) (org-eval-in-calendar '(calendar-forward-year 1))))

    (defun az-dired-up-directory ()
        "Take dired up one directory, but behave like dired-find-alternate-file"
        (interactive)
        (let ((old (current-buffer)))
            (dired-up-directory)
            (kill-buffer old)))

    ;; evil keybindings for dired
    (with-eval-after-load 'dired
    (evil-define-key 'normal dired-mode-map "h" 'az-dired-up-directory)
    (evil-define-key 'normal dired-mode-map "l" 'dired-find-alternate-file)
    (evil-define-key 'normal dired-mode-map "o" 'dired-sort-toggle-or-edit)
    (evil-define-key 'normal dired-mode-map "v" 'dired-toggle-marks)
    (evil-define-key 'normal dired-mode-map "m" 'dired-mark)
    (evil-define-key 'normal dired-mode-map "u" 'dired-unmark)
    (evil-define-key 'normal dired-mode-map "U" 'dired-unmark-all-marks)
    (evil-define-key 'normal dired-mode-map "c" 'dired-create-directory)
    (evil-define-key 'normal dired-mode-map "n" 'evil-search-next)
    (evil-define-key 'normal dired-mode-map "N" 'evil-search-previous))

    ;; evil keybindings for window movement
    (global-set-key (kbd "M-h") 'windmove-left)
    (global-set-key (kbd "M-l") 'windmove-right)
    (global-set-key (kbd "M-k") 'windmove-up)
    (global-set-key (kbd "M-j") 'windmove-down)

    (evil-mode 1))
#+end_src

*** esc quits everything

Comming from Vim it's a bit annoying to not be able to use ESC to quit
basically everything. This code fixes this.

#+begin_src emacs-lisp
;;; esc quits
(defun minibuffer-keyboard-quit ()
    "Abort recursive edit.
    In Delete Selection mode, if the mark is active, just deactivate it;
    then it takes a second \\[keyboard-quit] to abort the minibuffer."
    (interactive)
    (if (and delete-selection-mode transient-mark-mode mark-active)
        (setq deactivate-mark  t)
        (when (get-buffer "*Completions*")
              (delete-windows-on "*Completions*"))
        (abort-recursive-edit)))
(define-key evil-normal-state-map [escape] 'keyboard-quit)
(define-key evil-visual-state-map [escape] 'keyboard-quit)
(define-key minibuffer-local-map [escape] 'minibuffer-keyboard-quit)
(define-key minibuffer-local-ns-map [escape] 'minibuffer-keyboard-quit)
(define-key minibuffer-local-completion-map [escape] 'minibuffer-keyboard-quit)
(define-key minibuffer-local-must-match-map [escape] 'minibuffer-keyboard-quit)
(define-key minibuffer-local-isearch-map [escape] 'minibuffer-keyboard-quit)
#+end_src

*** evil-surround

evil-surround emulates the vim-surround plugin for vim. Both plugins
allow you to surround objects with an input of your choice. E.g.
surround a word with ~"~. Which would be: ~ysiw"~

- https://github.com/emacs-evil/evil-surround/blob/master/readme.org

#+begin_src emacs-lisp
(use-package evil-surround
    :ensure t
    :after evil
    :config
    (global-evil-surround-mode 1))
#+end_src

** UI

Various packages related to UI changes.

*** color-theme

This settings provides the color-theme package and sets a color-theme
which I store in my sourec directory as the current theme.

#+begin_src emacs-lisp
;; Color theme
;; disable background in terminal
(defun on-after-init ()
    (unless (display-graphic-p (selected-frame))
        (set-face-background 'default "unspecified-bg" (selected-frame))))

(add-hook 'window-setup-hook 'on-after-init)

(when (boundp 'enable-color-theme)
    ;; load solarized color theme
    (use-package solarized-theme
        :ensure t
        :config
        (setq solarized-use-variable-pitch nil)
        (setq solarized-scale-org-headlines nil)
        (setq solarized-high-contrast-mode-line t)
        (set-face-inverse-video 'region nil)
        (load-theme 'solarized-light t)))
#+end_src

** smooth-scrolling

I can't recall what this package does exactly, however it has to do
with scrolling in comparison to Vim.

#+begin_src emacs-lisp
;; smooth scrolling
(use-package smooth-scrolling
    :ensure t
    :config
    (setq scroll-margin 1
          scroll-conservatively 9999
          scroll-step 1))
#+end_src

** Various Tools
*** deft

Deft is a mode which lets you quickly search and create notes. It
works similarly to Notational Velocity. I configured it to use org
files and open org-mode to edit. In addition it should search in all
my org files. I search through all my org files and open deft with
~F5~.

- https://github.com/jrblevin/deft

#+begin_src emacs-lisp
(use-package deft
    :ensure t
    :bind ("<f5>" . deft)
    :commands (deft)
    :config
    (setq deft-extensions '("md")
          deft-default-extension "md"
          deft-markdown-mode-title-level 1
          deft-auto-save-interval 300.0
          deft-file-limit 50
          deft-use-filename-as-title nil
          deft-use-filter-string-for-filename t
          deft-recursive t)
    (setq deft-file-naming-rules
          '((noslash . "-")
            (nospace . "_")
            (case-fn . downcase)))
        (setq deft-directory "~/nextcloud/10_documents/"))
#+end_src

*** dash

Is required by many packages. I've added it specifically because it's
required by the org-insert-image function.

#+begin_src emacs-lisp
(use-package dash
    :defer t
    :ensure t)
#+end_src

*** swiper

Another dependency for the org-insert-image function.

#+begin_src emacs-lisp
(use-package swiper
    :defer t
    :ensure t)
#+end_src

*** s

The last depency for the org-insert-image function.

#+begin_src emacs-lisp
(use-package s
    :defer t
    :ensure t)
#+end_src

*** pdf-tools

pdf-tools is an alternativ for doc-view which works very nicely with
AUCTex.
https://github.com/politza/pdf-tools/blob/master/README.org
The config line is required so that a AUCTex compiled PDF gets updated
after each compilation.

#+begin_src emacs-lisp
(when (boundp 'enable-pdf-tools)
(use-package pdf-tools
    :ensure t
    :mode ("\\.pdf\\'" . pdf-view-mode)
    :config
    (pdf-tools-install)
    (setq-default pdf-view-display-size 'fit-page)
    ;; turn off cua so copy works
    (add-hook 'pdf-view-mode-hook (lambda () (cua-mode 0)))
    ;; keyboard shortcuts
    (define-key pdf-view-mode-map (kbd "C-w C-w") 'other-window)
    (define-key pdf-view-mode-map (kbd "j") 'pdf-view-next-page-command)
    (define-key pdf-view-mode-map (kbd "k") 'pdf-view-previous-page-command)
    (define-key pdf-view-mode-map (kbd "h") 'pdf-annot-add-highlight-markup-annotation)
    (define-key pdf-view-mode-map (kbd "t") 'pdf-annot-add-text-annotation)
    (define-key pdf-view-mode-map (kbd "D") 'pdf-annot-delete)
    (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)))
#+end_src

*** treemacs

Treemacs is a tool which display a file explorer in a little buffer on
the side of your main buffer. This is very useful if you're working on
a project which consists of multiple files. It even understands some
files and can display their sections (org-mode), or classes (python).

- https://github.com/Alexander-Miller/treemacs

#+begin_src emacs-lisp
(use-package treemacs
    :ensure t
    :bind ("<f12>" . treemacs)
    :config
    (progn
        (use-package treemacs-evil
        :ensure t
        :demand t)))
#+end_src

*** yasnippet

Yasnippet is a package with which you can insert code or text snippets
based on templates. It already comes with a wide variety of snippets
and you can easily define your own.

- https://github.com/joaotavora/yasnippet

#+begin_src emacs-lisp
;; enable yasnippet
(use-package yasnippet
    :ensure t
    :config
    (yas-global-mode 1))
#+end_src

**** yasnippet-snippets

The default snippets got moved into their seperate package. I'm
loading it after the main yasnippet package.

#+begin_src emacs-lisp
;; enable yasnippet
(use-package yasnippet-snippets
    :ensure t
    :after yasnippet
    :config
    (yas-global-mode 1))
#+end_src

**** org-mode snippets

| key       | function                                |
|-----------+-----------------------------------------|
| img_      | insert an html snippet for images       |
|-----------+-----------------------------------------|
| pic_      | inserts a snippet for latex images      |
|-----------+-----------------------------------------|
| orgtemp   | inserts a template for org files        |
|-----------+-----------------------------------------|
| orgrev    | template for org-reveal                 |
|-----------+-----------------------------------------|
| orgbeamer | template for beamer presentations       |
|-----------+-----------------------------------------|
| clk       | template for a clock report             |
|-----------+-----------------------------------------|
| orgconf   | template for config files writen in org |
|-----------+-----------------------------------------|
| _project  | inserts a section for a new project     |
|-----------+-----------------------------------------|

*** which-key

Displays a small buffer which shows all the possible key combinations
you can press at the current moment.

- https://github.com/justbur/emacs-which-key

#+begin_src emacs-lisp
;; which key is a package to show which keys can be pressed
(use-package which-key
    :ensure t
    :diminish which-key-mode
    :config
    (which-key-mode))
#+end_src

*** discover-my-major

discover-my-major is a package which shows you all the keybindings
related to the current major mode. While you can get this information
with the ~C-h m~ keybindings it's a bit easier to view in this mode.

- https://github.com/steckerhalter/discover-my-major

#+begin_src emacs-lisp
(use-package discover-my-major
    :ensure t
    :bind ("C-h C-m" . discover-my-major))
#+end_src

