home-manager/software/emacs/emacs.d/loader.org
*** markdown-mode

Provides syntax highlighting and other functions for markdown.

#+begin_src emacs-lisp
;; add markdown-mode to edit markdown files
(use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init
        (setq markdown-command "multimarkdown")
        (setq markdown-enable-wiki-links t
            markdown-hide-urls t
            markdown-enable-highlighting-syntax t
            markdown-link-space-sub-char " ")
    :config
    (defun insert-file-name-as-wikilink (filename &optional args)
        (interactive "*fInsert file name: \nP")
        (insert (concat "[[" (file-name-sans-extension (file-relative-name
        filename)) "]]")))

    (define-key markdown-mode-map (kbd "C-c i") 'insert-file-name-as-wikilink))
#+end_src

*** powershell

Provides syntax highlighting and other functions for powershell
scripts.

#+begin_src emacs-lisp
;; enable powershell-mode
(use-package powershell
    :ensure t
    :mode
    (("\\.ps1\\'" . powershell-mode)
    ("\\.psm1\\'" . powershell-mode)))
#+end_src

*** auctex

Auctex is a great package which helps you a lot when you're writing
LaTeX documents.

#+begin_src emacs-lisp
(when (boundp 'enable-auctex)
;; auctex a greate plugin for latex writing
(use-package latex
    :if (is-linux-p)
    :ensure auctex
    :mode ("\\.tex\\'" . latex-mode)
    :ensure-system-package
    (pdflatex . texlive-full)
    :config
    (setq-default TeX-master nil)
    (setq TeX-auto-save t)
    (setq TeX-parse-self t)
    (setq TeX-electric-math (quote ("\\(" . "\\)")))
    (setq LaTeX-electric-left-right-brace t)
    (setq TeX-view-program-selection
        (quote
            (((output-dvi has-no-display-manager)
            "dvi2tty")
            ((output-dvi style-pstricks)
            "dvips and gv")
            (output-dvi "xdvi")
            (output-pdf "PDF Tools")
            (output-html "xdg-open"))))))
#+end_src

*** yaml-mode

A mode to work with yaml files.

#+begin_src emacs-lisp
(use-package yaml-mode
    :defer t
    :mode
    (("\\.yml\\'" . yaml-mode)
    ("\\.yaml\\'" . yaml-mode))
    :interpreter ("yml" . yml-mode)
    :ensure t)
#+end_src

*** python-mode

While Emacs comes by default with python-mode installed. I want to use
the updated version from Melpa.

#+begin_src emacs-lisp
(use-package python-mode
    :ensure t
    :defer t
    :config
    (setq python-shell-interpreter "python3"))
#+end_src

*** elpy

elpy is a package which helps you greatly with writing Python code. It
provides all the things you would wish from an IDE.

- https://github.com/jorgenschaefer/elpy

#+begin_src emacs-lisp
(use-package elpy
    :ensure t
    :config
    (setq elpy-rpc-python-command "python3")
    (setq elpy-test-runner 'elpy-test-pytest-runner)
    (setq eldoc-idle-delay 1)
    (add-hook 'python-mode-hook (lambda () (highlight-indentation-mode -1)))
    (elpy-enable))
#+end_src

** Coding Tools

*** company-mode

company-mode is a package to provide auto-complete functionality.

- https://company-mode.github.io/

#+begin_src emacs-lisp
(use-package company
    :ensure t
    :bind
    ("C-<tab>" . company-complete)
    :config
    (setq company-idle-delay 0)
    (define-key company-active-map (kbd "TAB") 'company-complete-common-or-cycle)
    (define-key company-active-map (kbd "<tab>") 'company-complete-common-or-cycle)
    (setq company-dabbrev-downcase nil)
    (add-hook 'after-init-hook 'global-company-mode)

    ;; Add yasnippet support for all company backends
    (defvar company-mode/enable-yas t
        "Enable yasnippet for all backends.")
    (defun company-mode/backend-with-yas (backend)
        (if (or (not company-mode/enable-yas) (and (listp backend) (member 'company-yasnippet backend)))
        backend
            (append (if (consp backend) backend (list backend))
              '(:with company-yasnippet))))
    (setq company-backends (mapcar #'company-mode/backend-with-yas company-backends)))
#+end_src

**** company-auctex

Auctex support for company-mode.
- https://github.com/alexeyr/company-auctex/

#+begin_src emacs-lisp
(when (boundp 'enable-auctex)
(use-package company-auctex
    :if (is-linux-p)
    :ensure t
    :after auctex
    :defer t
    :init
    (add-hook 'LaTeX-mode-hook 'company-auctex-init)))
#+end_src

**** company-web

https://github.com/dakra/dmacs/blob/master/init.org

#+BEGIN_SRC emacs-lisp
(use-package company-web
    :ensure t
    :after web-mode
    :commands company-web-html
    :config
    (require 'company-web-html)

    ;; Tide completion support in web-mode with company-mode
    (defun my-web-mode-hook ()
        "Hook for `web-mode'."
        (set (make-local-variable 'company-backends)
            '(company-tide company-web-html company-yasnippet company-files)))

    (add-hook 'web-mode-hook 'my-web-mode-hook)

    ;; Enable JavaScript completion between <script>...</script> etc.
    (defadvice company-tide (before web-mode-set-up-ac-sources activate)
        "Set `tide-mode' based on current language before running company-tide."
        (if (equal major-mode 'web-mode)
            (let ((web-mode-cur-language
                (web-mode-language-at-pos)))
                (if (or (string= web-mode-cur-language "javascript")
                    (string= web-mode-cur-language "jsx"))
                (unless tide-mode (tide-mode))
                (if tide-mode (tide-mode -1)))))))
#+END_SRC

**** company-restclient

https://github.com/dakra/dmacs/blob/master/init.org

#+BEGIN_SRC emacs-lisp
(use-package company-restclient
    :ensure t
    :after (restclient company)
    :config (add-to-list 'company-backends 'company-restclient))
#+END_SRC

*** magit

Magit is a package which allows you to control git from within Emacs.
It's really great and makes using git so much easier. Thanks to Magit
alone I think I became a much better git user.

- https://magit.vc/

#+begin_src emacs-lisp
;; enable magit a great git porcelain.
(use-package magit
    :ensure t
    :commands magit-status
    :bind
    ("<f10>" . magit-status))
#+end_src

*** rainbow-delimiters

Each level of parantheses has it's own colour to differentiate them
more easily.

#+begin_src emacs-lisp
;; change the colours of parenthesis the further out they are
(use-package rainbow-delimiters
    :ensure t
    :config
    (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
#+end_src

*** elisp-bug-hunter

This package let's you debug your Emacs config which makes it easier
to find bugs before you restart Emacs.

https://github.com/Malabarba/elisp-bug-hunter/blob/master/README.org

#+begin_src emacs-lisp
(use-package bug-hunter
    :defer t
    :ensure t)
#+end_src

*** flycheck

flycheck is a handy tool to provide syntax checking on the fly.

- http://www.flycheck.org/en/latest/

#+begin_src emacs-lisp
(use-package flycheck
    :ensure t)
#+end_src

*** highlight-indent-guides

This mode shows lines to display the current level of indentation. I've enabled
it in text- and prog-modes.
https://github.com/DarthFennec/highlight-indent-guides

#+BEGIN_SRC emacs-lisp
(use-package highlight-indent-guides
    :ensure t
    :config
    (setq highlight-indent-guides-method 'character
          hightlight-indentation-mode nil
          highlight-indent-guides-auto-enabled nil)
    (set-face-background 'highlight-indent-guides-odd-face "darkgray")
    (set-face-background 'highlight-indent-guides-even-face "gray")
    (set-face-foreground 'highlight-indent-guides-character-face "gray")
    (add-hook 'text-mode-hook 'highlight-indent-guides-mode)
    (add-hook 'prog-mode-hook 'highlight-indent-guides-mode))
#+END_SRC

*** direnv

Enable direnv support.

#+begin_src emacs-lisp
(use-package direnv
 :config
 (direnv-mode))
#+end_src

*** format-all

#+begin_src emacs-lisp
(use-package format-all
    :ensure t
    :hook
    ((prog-mode . format-all-ensure-formatter)
     (yaml-mode . format-all-ensure-formatter)
     (prog-mode . format-all-mode))
    :preface
    (defun nebucatnetzer/format-code ()
        "format buffer."
        (interactive)
        (format-all-buffer))
    :config
    (global-set-key (kbd "C-c C-f") #'nebucatnetzer/format-code)
    (setq format-all-show-errors 'errors))
#+end_src
* Email

Requires the following packages to be installed:

#+BEGIN_EXAMPLE
offlineimap mu4e w3m
#+END_EXAMPLE

After a fresh installation you have to first sync your emails with ~offlineimap

-o~. Afterwards run ~mu index --maildir=~/Maildir~.

#+BEGIN_SRC emacs-lisp
(when (boundp 'enable-email)
(use-package mu4e
    :if (is-linux-p)
    :config
        (require 'smtpmail)

        ;; use msmtp
        (setq message-send-mail-function 'message-send-mail-with-sendmail)
        (setq sendmail-program "msmtp")

        (require 'mu4e)
        (require 'org-mu4e)

        (setq mu4e-completing-read-function (quote ivy-completing-read))
        (setq mail-user-agent 'mu4e-user-agent)

        (setq mu4e-drafts-folder "/personal/Drafts")
        (setq mu4e-sent-folder   "/personal/Sent")
        (setq mu4e-trash-folder  "/personal/Trash")
        (setq mu4e-refile-folder "/personal/Archive")

        (setq browse-url-browser-function 'browse-url-generic
            browse-url-generic-program "firefox")

        (require 'mu4e-contrib)
        (setq mu4e-html2text-command 'mu4e-shr2text)
        (add-to-list 'mu4e-view-actions
            '("ViewInBrowser" . mu4e-action-view-in-browser) t)

        (setq mu4e-headers-fields
                '((:date          .  10)    ;; alternatively, use :human-date
                  (:flags         .   5)
                  (:from          .  22)
                  (:subject       .  nil))) ;; alternatively, use :thread-subject

        (setq mu4e-get-mail-command "offlineimap -qo"
            mu4e-update-interval 120
            mu4e-headers-auto-update t
            mu4e-compose-format-flowed t
            mu4e-index-update-in-background t
            mu4e-compose-dont-reply-to-self t
            mu4e-attachment-dir "~/nextcloud/10_documents/01_inbox"
            mu4e-compose-signature-auto-include nil)

        (add-hook 'mu4e-view-mode-hook 'visual-line-mode)

        (setq mu4e-maildir-shortcuts
            '(("/personal/INBOX" . ?i)
              ("/personal/Sent" . ?s)
              ("/personal/Trash" . ?t)
              ("/personal/Archive" . ?a)
              ("/personal/Drafts" . ?d)))

        ;; show images
        (setq mu4e-show-images t)

        ;; general emacs mail settings; used when composing e-mail
        ;; the non-mu4e-* stuff is inherited from emacs/message-mode
        (setq mu4e-reply-to-address "andreas@zweili.ch")

        (setq message-kill-buffer-on-exit t)
        ;; Don't ask for a 'context' upon opening mu4e
        (setq mu4e-context-policy 'pick-first)
        ;; Don't ask to quit
        (setq mu4e-confirm-quit nil)

        ;; spell check
        (add-hook 'mu4e-compose-mode-hook
                (defun my-do-compose-stuff ()
                "My settings for message composition."
                (setq mu4e-compose-format-flowed t)
                (use-hard-newlines -1)
                (electric-indent-local-mode -1)
                (turn-off-auto-fill)
                (flyspell-mode)))))
#+END_SRC

* UI Changes

** Hide the menu and toolbar

I like to work in a distraction free editor that's why I hide all the
menues, toolbars and scrollbars.

#+begin_src emacs-lisp
;; disable menu and toolbar
(tool-bar-mode -1)
(menu-bar-mode -99)
(when (boundp 'enable-scroll-bar)
(scroll-bar-mode -1))
#+end_src

** Line wrapping

By default Emacs doesn't do line wrapping. Instead it shows you on the
edge of the buffer a marker to indicate that the line continues
further. I'm not really a fan of this behaviour, that's why I disable
it and enable proper line wrapping.

*** enable line wrapping

#+begin_src emacs-lisp
; Proper line wrapping
(global-visual-line-mode 1)
#+end_src

*** disable fringe mode

fringe-mode are the little markers on the side of the buffer which
show when a line continues over the edge. Since I use visual-line-mode
this settings isn't required anymore.

#+begin_src emacs-lisp
(when (boundp 'disable-fringe)
; Disable fringe because I use visual-line-mode
(set-fringe-mode '(0 . 0)))
#+end_src

** Disable the splash screen

Emacs usually displays a splash screen with some helpful information
for beginners. I don't really need that anymore.

#+begin_src emacs-lisp
; Disable splash screen
(setq inhibit-splash-screen t)
#+end_src

** Disable tooltips

Can't remember how they look like but I've disabled them
probably for a reason :).

#+begin_src emacs-lisp
(tooltip-mode -1)
(setq tooltip-use-echo-area t)
#+end_src

** Prompts
*** Y and N are enough

I don't want to type the whole word. The starting characters should be
enough.

#+begin_src emacs-lisp
;; disable or reconfigure prompts
(fset 'yes-or-no-p 'y-or-n-p) ;; remap yes or no to y or n
#+end_src

*** Don't prompt on buffer creation

"Yes I'm sure that I want to create a new buffer.", options.

#+begin_src emacs-lisp
(setq confirm-nonexistent-file-or-buffer nil);; just create buffers don't ask
(setq ido-create-new-buffer 'always)
#+end_src

** Hightlight whitespace

This options shows you where you accidentally left some bad
whitespace.

#+begin_src emacs-lisp
;; highlight bad whitespace
(use-package whitespace
    :ensure t
    :config
    (setq whitespace-style '(face lines-tail tabs trailing))
    (set-face-attribute 'whitespace-line nil :foreground "#af005f")
    (global-whitespace-mode t))
#+end_src

** Font

Set the font to the nice Source Code Pro. I think it works quite well for coding
as well as writing text.

#+begin_src emacs-lisp
(when (boundp 'enable-font)
(set-face-attribute 'default nil
    :family "Source Code Pro"
    :height 120
    :weight 'normal
    :width 'normal))
#+end_src

** Doc-view resolution

By default the doc-view looks a bit fuzzy. With a resolution of 200
it's much more comfortable to read a PDF.

#+begin_src emacs-lisp
(when (boundp 'enable-pdf-tools)
;; improve the resolution of doc-view
(setq doc-view-resolution 200))
#+end_src

** Start Emacs maximized

I always want to run Emacs maximized. The easiest solution to this problem
is the following code. The downside of this is, that if Emacs is already
maximized it will switch to windowed mode.

#+begin_src emacs-lisp
(toggle-frame-maximized)
#+end_src

** mode-line settings

#+begin_src emacs-lisp
(setq-default mode-line-format
              '("%e"
                mode-line-front-space
                ;; mode-line-mule-info
                mode-line-client
                mode-line-modified
                mode-line-remote
                mode-line-frame-identification
                mode-line-buffer-identification
                "   "
                mode-line-position
                (vc-mode vc-mode)
                ;; "  "
                ;; mode-line-modes
                "   "
                mode-line-misc-info
                ;; battery-mode-line-string
                ;; mode-line-end-spaces
))
#+end_src

** display line numbers

Since I'm an evil user I would like to display the line numbers relativ to the
cursor position and only show the line numbers for the visible content.

#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type 'visual)
(add-hook 'prog-mode-hook (lambda ()
    (when (version<= "26.0.50" emacs-version )
        (display-line-numbers-mode))))
#+END_SRC

** inhibit-compacting-font-caches

Should improve performance a bit when working with org-mode and in general

#+begin_src elisp
(setq inhibit-compacting-font-caches t)
#+end_src

