home-manager/software/emacs/emacs.d/lib/loader.el
(use-package bug-hunter
  :defer t
  :ensure t)

(use-package direnv
  :config
  (direnv-mode))

;; My details
