home-manager/software/emacs/emacs.d/loader.org
** org-update-cookies-after-save

It can happen that statistic cookies in an org-mode buffer don't get
updated. This function updates all the statistic cookies before the
buffer gets saved.

#+begin_src emacs-lisp
    (defun org-update-cookies-after-save()
    (interactive)
    (let ((current-prefix-arg '(4)))
    (org-update-statistics-cookies "ALL")))

    (add-hook 'org-mode-hook
        (lambda ()
            (add-hook 'before-save-hook 'org-update-cookies-after-save nil 'make-it-local)))
#+end_src

** mark-task-as-done

This function sets a parent to the DONE state when the last of it's
children gets changed to DONE. This is especially usefull in
combination with org-edna.

- https://orgmode.org/manual/Breaking-down-tasks.html

#+begin_src emacs-lisp
    (defun org-summary-todo (n-done n-not-done)
    "Switch entry to DONE when all subentries are done, to TODO otherwise."
    (let (org-log-done org-log-states)   ; turn off logging
        (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

    (add-hook 'org-after-todo-statistics-hook 'org-summary-todo))
#+end_src

** Personal org file

I defined ~C-c p~ to quickly jump to my personal org file.

#+begin_src emacs-lisp
;; keymap for my personal.org file
(when (boundp 'enable-personal-agenda)
    (when (is-linux-p)
        (global-set-key (kbd "C-c p")
            (lambda () (interactive) (find-file "~/nextcloud/12_tasks/personal.org")))))
(when (boundp 'enable-work-agenda)
(when (is-windows-p)
    (global-set-key (kbd "C-c p")
        (lambda () (interactive) (find-file "~/nextcloud/03_documents/org/agenda/work/work.org")))))
#+end_src

* General
** User data

#+begin_src emacs-lisp
;; My details

(setq user-full-name "Andreas Zweili")
(setq user-mail-address "andreas@zweili.ch")
#+end_src

** Toggle window splits

Sometimes when emacs opens a buffer it's in a wrong orientation. With
the keybinding ~C-x 4~ I can toggle between horizontal and vertical
split.

#+begin_src emacs-lisp
;; a function to toggle the splits
(defun toggle-window-split ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
            (next-win-buffer (window-buffer (next-window)))
            (this-win-edges (window-edges (selected-window)))
            (next-win-edges (window-edges (next-window)))
            (this-win-2nd (not (and (<= (car this-win-edges)
                (car next-win-edges))
                (<= (cadr this-win-edges)
                    (cadr next-win-edges)))))
            (splitter
                (if (= (car this-win-edges)
                    (car (window-edges (next-window))))
                    'split-window-horizontally
                    'split-window-vertically)))
            (delete-other-windows)
            (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))

(define-key ctl-x-map "4" 'toggle-window-split)
#+end_src

** Split Windows and move cursor into it

Usually when I want to split the window I want the cursor to be place
into the new window because I need to manipulate that window. Emacs
doesn't do this by default but we can add that functionality.

#+begin_src emacs-lisp
(defun nebucatnetzer:split-window-below-and-move-cursor ()
    (interactive)
    (split-window-below)
    (other-window 1))

(defun nebucatnetzer:split-window-right-and-move-cursor ()
    (interactive)
    (split-window-right)
    (other-window 1))

(global-set-key (kbd "C-x 2") 'nebucatnetzer:split-window-below-and-move-cursor)
(global-set-key (kbd "C-x 3") 'nebucatnetzer:split-window-right-and-move-cursor)
#+end_src

** Use spaces instead of tabs

#+begin_src emacs-lisp
;; Spaces instead of TABs
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq indent-line-function 'insert-tab)
#+end_src

** Key bindings
*** buffer switching

ibuffer is a much better way to give an overview than the standard buffer
view in emacs. Interestingly it's already built in but not configured.
You can open it with ~C-x C-b~. Ivy is a nice tool for completions I configured
~C-x b~ to open Ivy for switching buffers.

#+begin_src emacs-lisp
;; keymap for buffer switching
(global-set-key (kbd "C-x C-b") 'ibuffer)
(global-set-key (kbd "C-x b") 'ivy-switch-buffer)
#+end_src

*** kill current buffer

Don't ask which buffer to kill, kill the current buffer with ~C-x C-k~.

#+begin_src emacs-lisp
;; kill THIS buffer
(global-set-key (kbd "C-x C-k") 'kill-this-buffer)
#+end_src

*** Copy buffer to clipboard

Sometimes it's handy to be able the complete buffer into the clipboard.
E.g. when you write an email in Emacs an want to copy it into Outlook.
This function is bound to ~C-S-c~.

#+begin_src emacs-lisp
;; copy the complete buffer to the clipboard
(defun copy-all ()
    "Copy entire buffer to clipboard"
    (interactive)
    (clipboard-kill-ring-save (point-min) (point-max)))

(global-set-key (kbd "C-S-c") 'copy-all)
#+end_src

*** Frame Controls

This keybindings allow to create and navigate frames.
Frames are in a desktop environment usually called windows.
However because Emacs is so old it has it's own terminology.

- New frame ::
    ~C-x N~

- Switch to the other frame ::
    ~C-x O~

- Kill frame ::
    ~C-x K~

#+begin_src emacs-lisp
;; keybinding for new frame
(global-set-key (kbd "C-x N") 'make-frame)

;; switch to frame
(global-set-key (kbd "C-x O") 'other-frame)

;; kill frame
(global-set-key (kbd "C-x K") 'delete-frame)
#+end_src

*** Hippie Expand

This option enables hippie expand which allows for path complition and
more. You can execute it with ~M-Space~.

#+begin_src emacs-lisp
;; enable hippie expand on M-Space
(global-set-key "\M- " 'hippie-expand)
#+end_src

*** jump to minibuffer

#+begin_src emacs-lisp
(defun switch-to-minibuffer () "Switch to minibuffer window."
    (interactive) (if (active-minibuffer-window)
        (select-window
            (active-minibuffer-window)) (error "Minibuffer is not active")))

(bind-key "M-m" 'switch-to-minibuffer)
#+end_src

** File encoding
*** Prefer Unix encoding.

#+begin_src emacs-lisp
;; file encodings
(prefer-coding-system 'utf-8-unix)
#+end_src

** Move backup files to the temp folder

With this configuration Emacs saves the backup files into the temp
directory. Otherwise they get created in the current directory which
IMO is unneeded clutter.

#+begin_src emacs-lisp
(setq backup-directory-alist
    `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
    `((".*" ,temporary-file-directory t)))
#+end_src

** ibuffer, buffer groups

This function groups buffers depending on their mode which gives an
even better overview. In addition it hides temporary buffers from the
ibuffer view.

#+begin_src emacs-lisp
;; hide temporary buffers
(add-hook 'ibuffer-mode-hook
    (lambda ()
        (ibuffer-filter-by-name "^[^*]")))

(setq ibuffer-saved-filter-groups
    (quote (("default"
        ("Org" ;; all org-related buffers
            (mode . org-mode))
        ("Programming" ;; prog stuff not already in MyProjectX
            (or
                (mode . python-mode)
                (mode . web-mode)
                (mode . php-mode)
                (mode . csharp-mode)
                (mode . javascript-mode)
                (mode . sql-mode)
                (mode . powershell-mode)
                (mode . emacs-lisp-mode)))
                ;; etc
        ("Dired"
            (mode . dired-mode))))))

(add-hook 'ibuffer-mode-hook
    (lambda ()
        (ibuffer-switch-to-saved-filter-groups "default")))
#+end_src

** Initial buffer mode

When I create a new buffer it should start in text-mode.
By default Emacs uses elisp-mode.

#+begin_src emacs-lisp
;; initial buffers should use text-mode
(setq-default major-mode 'text-mode)
#+end_src

** Localization
*** First day of the week

In Switzerland weeks start on Monday not Sunday.

#+begin_src emacs-lisp
; Calender should start on Monday
(setq calendar-week-start-day 1)
#+end_src

*** Spell checking

Since I write both in English and in German I need two dictionaries.
This code configures Emacs to use the Linux dictionaries en_US and
de_CH. If you want to switch languages you need the function:
~ispell-change-dictionary~

#+begin_src emacs-lisp
;; ispell settings
(setenv "DICTIONARY" "en_US")
(setq ispell-program-name "hunspell")
(setq ispell-local-dictionary "en_US")
(setq ispell-local-dictionary-alist
      '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)
        ("de_CH" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "de_CH") nil utf-8)))
#+end_src

*** Spaces after periods.

#+begin_src emacs-lisp
;; insert only one space after a period
(setq sentence-end-double-space nil)
#+end_src

** Parantheses
*** Math parantheses

This setting shows matching parantheses and hightlights the ones which
don't have a counter part.

#+begin_src emacs-lisp
; Matches parentheses and such in every mode
(show-paren-mode 1)
#+end_src

*** Electric parantheses

When you insert a parenthesis it's counter pair gets inserted automatically.

#+begin_src emacs-lisp
;; pair parentheses
(electric-pair-mode 1)
#+end_src

** Auto-fill

This enables auto-fill which is basically line wrapping.

#+begin_src emacs-lisp
(add-hook 'text-mode-hook 'turn-on-auto-fill)
#+end_src

** Suppressing ad-handle-definition Warnings

This settings surpresses the following warning which shows up when
Emacs starts:

#+begin_example
ad-handle-definition: `tramp-read-passwd' got redefined
#+end_example

#+begin_src emacs-lisp
(setq ad-redefinition-action 'accept)
#+end_src

** remove bad whitespace when saving

#+begin_src emacs-lisp
(add-hook 'before-save-hook 'whitespace-cleanup)
#+end_src

** Autorefresh buffers if the file changes on disk

#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode t)
#+END_SRC

** 80 characters line width

#+BEGIN_SRC emacs-lisp
(setq-default fill-column 79)
#+END_SRC

** show column number

#+BEGIN_SRC emacs-lisp
(setq column-number-mode 1)
#+END_SRC

** display emojis

Display Emoji requires the ~fonts-symbola~ Debian package.

#+BEGIN_SRC emacs-lisp
(when (boundp 'enable-emojis)
(when (is-linux-p)
    (set-fontset-font t nil "Symbola" nil 'prepend)))
#+END_SRC

** kill all buffers

This function is helpful to "clean up" emacs without having to restart it.

#+BEGIN_SRC emacs-lisp
(defun kill-other-buffers ()
    "Kill all other buffers."
    (interactive)
    (mapc 'kill-buffer
        (delq
            (current-buffer)
            (buffer-list))))
#+END_SRC

** insert date

#+begin_src emacs-lisp
(defun insert-date ()
    "Insert the current date."
    (interactive)
    (let ((format "%d.%m.%Y")
          (system-time-locale "de_CH"))
      (insert (format-time-string format))))

(defun insert-iso-date ()
    "Insert the current date in the ISO format."
    (interactive)
    (let ((format "%Y-%m-%d")
          (system-time-locale "de_CH"))
      (insert (format-time-string format))))

(defun insert-full-date ()
    "Insert the current date, write out the day and month name."
    (interactive)
    (let ((format "%A, %d. %B %Y")
          (system-time-locale "de_CH"))
      (insert (format-time-string format))))
#+end_src

** handling large files

Taken from here:
https://github.com/jhallen/joes-sandbox/issues/29

#+begin_src emacs-lisp
(defun buffer-too-big-p ()
  (or (> (buffer-size) (* 5000 64))
      (> (line-number-at-pos (point-max)) 5000)))
(defun generic-setup ()
  ;; turn off `linum-mode' when there are more than 5000 lines
  (if (buffer-too-big-p) (display-line-numbers-mode -1)))

(add-hook 'prog-mode-hook 'generic-setup)
(add-hook 'text-mode-hook 'generic-setup)
#+end_src

** remove duplicates from history

#+begin_src emacs-lisp
(setq history-delete-duplicates t)
#+end_src

** enable mouse support in terminal

#+begin_src emacs-lisp
(xterm-mouse-mode 1)
#+end_src

** Disable electric-indent-local-mode

This mode indents all the text I write in text-mode.
Not really useful in my usecase.

(add-hook 'text-mode-hook (lambda () (electric-indent-local-mode -1)))

* Eshell

** General

Make the tab completion behave like in Bash.

#+begin_src emacs-lisp
(add-hook 'eshell-mode-hook
    (lambda ()
        (setq pcomplete-cycle-completions nil)))
#+end_src

* Tramp

** default-tramp-method

To improve the perfomance of tramp I use SSH instead of scp.

#+begin_src emacs-lisp
(setq tramp-default-method "ssh")
#+end_src

* LaTex
** Align Tables

This is a nice function to work with LaTeX tables. I've got it from
here: https://thenybble.de/projects/inhibit-auto-fill.html

#+begin_src emacs-lisp
(when (boundp 'enable-auctex)
(defun LaTeX-collapse-table ()
    (interactive)
    (save-excursion
        (LaTeX-mark-environment)
        (while (re-search-forward "[[:space:]]+\\(&\\|\\\\\\\\\\)" (region-end) t)
            (replace-match " \\1"))))

(defun LaTeX-align-environment (arg)
    (interactive "P")
    (if arg
        (LaTeX-collapse-table)
        (save-excursion
            (LaTeX-mark-environment)
            (align (region-beginning) (region-end))))))
#+end_src

** Inhibiting auto-fill

"Auto-fill is nice. Filling to 80 columns (as god intended) makes code
or any other text easier to read.

However, it's not so nice for large latex tables that you want to
align properly (perhaps using align). This is why I hacked together
some elisp to inhibit auto-fill when the cursor is in a table (or any
other environment that doesn't need to be auto-filled, according to
your whims."

Taken from here:
https://thenybble.de/projects/inhibit-auto-fill.html

#+begin_src emacs-lisp
(when (boundp 'enable-auctex)
(defcustom LaTeX-inhibited-auto-fill-environments
    '("tabular" "tikzpicture") "For which LaTeX environments not to run auto-fill.")

(defun LaTeX-limited-auto-fill ()
    (let ((environment (LaTeX-current-environment)))
        (when (not (member environment LaTeX-inhibited-auto-fill-environments))
            (do-auto-fill)))))
#+end_src

** Enable the LaTeX tweaks

#+begin_src emacs-lisp
(when (boundp 'enable-auctex)
(global-set-key (kbd "C-c f") 'LaTeX-align-environment)
(setq auto-fill-function 'LaTeX-limited-auto-fill))
#+end_src

* Dired
** open a folder in the same buffer

By default dired obens a buffer for every folder one opens. With this setting
it's possible open a folder in the current buffer when pressing ~a~ on it.

#+BEGIN_SRC emacs-lisp
(put 'dired-find-alternate-file 'disabled nil)
#+END_SRC

** use human readable formats

#+BEGIN_SRC emacs-lisp
(setq-default dired-listing-switches "-alh")
#+END_SRC

** Keybindings
